# TODO:
# Реализовать класс SuperLinearResolver, принимающий в конструктор коэффициенты(k, b) туплами.
# k, b принадлежат полю натуральных.
# У класса должен быть метод, позволяющий через круглые скобочки(!) решить заданные уравнения.
# Если уравнение задано неверно(т.е. k=0), то вместо численного значения отдаётся None, а текст исключения
# 	должен быть выведен в консоль и содержать кроме текста ошибки уравнение в виде "y = kx + b" (k, b - подставить).
# Функцию resolve изменять нельзя.
# Все решения являются или float, или None.
# Решения возвращаются с точностью 2 знака после запятой.
# Решение должно быть оптимальным по ресурсам.
# Минимально позаботиться о развёртке в чистом окружении.


from src.SuperLinearResolver import SuperLinearResolver as Resolver


def main():
	args = None  # TODO: в этом файле изменять можно только способ заполнения args значениями
	resolver = Resolver(args)
	roots = resolver()
	print(roots)
	print(Resolver(args)())


if __name__ == "__main__":
	main()
